## Staging: cognito
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                         = "ca-central-1_Cguq9JNQ1"
        name                       = "forms_user_pool"
        tags                       = {}
        # (12 unchanged attributes hidden)

      ~ lambda_config {
          + create_auth_challenge          = (known after apply)
          + define_auth_challenge          = "arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Define_Auth_Challenge"
          + verify_auth_challenge_response = "arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Verify_Auth_Challenge"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.forms will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "forms" {
      ~ explicit_auth_flows                  = [
          + "ALLOW_CUSTOM_AUTH",
            # (2 unchanged elements hidden)
        ]
        id                                   = "17bsg3b2b7q5snon007rru264u"
        name                                 = "forms_client"
        # (14 unchanged attributes hidden)
    }

  # aws_lambda_function.create_auth_challenge will be created
  + resource "aws_lambda_function" "create_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/create_auth_challenge_main.zip"
      + function_name                  = "Cognito_Create_Auth_Challenge"
      + handler                        = "create_auth_challenge.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_cognito_lambda"
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "a558FolyXFqP70dWtM31xNeYm00LTl59ifhV76rJkcU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_layer_version.create_auth_challenge_nodejs will be created
  + resource "aws_lambda_layer_version" "create_auth_challenge_nodejs" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs16.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/create_auth_challenge_nodejs.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "create_auth_challenge_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "h81uo848zuFF292ja3VaG9u1S1c6dZWL2cJgURojjKU="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
